// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Atualização do Firmware";

// Errors
FileOpenError = "Não é possível abrir o arquivo %@";
FileOpenErrorExplanation = "Este arquivo está corrupto ou pode ter mudado de localização, ter sido renomeado ou excluído. Verifique a localização do arquivo ou selecione outro arquivo, e tente novamente.";
PrintChannelOpenError = "Não é possível abrir um canal da impressora";
PrintChannelOpenErrorExplanation = "Verifique se a impressora está conectada e ligada, e tente novamente.";
SendDataError = "Não é possível enviar dados para a impressora";
SendDataErrorExplanation = "Verifique se a impressora está conectada e ligada, e tente novamente.";

SomePenErrorTitle = "Não é possível atualizar o firmware";
DoorOpenMsg = "Não é possível atualizar o firmware porque uma tampa está aberta. Feche todas as tampas da impressora.";

// Aquamarine Errors
FileCheckError = "Não é possível atualizar o firmware";
FileCheckErrorExplanation = "O pacote de firmware não é válido. Selecione outro arquivo e tente novamente.";

OkButton = "Ok";
CancelButton = "Cancelar";
FirmwareUpdateTitle = "Atualização do Firmware";
FirmwareUpdateDeviceState = "Imprimindo";
FirmwareUpdateCancelingDeviceState = "Cancelando";

// Great Wall Messages
PrinterIdleWarning = "A atualização do firmware pode falhar se a impressora estiver ocupada (por exemplo, imprimindo um trabalho ou sendo calibrada).\n\nVerifique se a impressora está ociosa antes de prosseguir com o processo de atualização do firmware.";
UpdateSuccessful = "O arquivo do firmware foi carregado com sucesso e a impressora está quase atualizada.\n\Quando a atualização do firmware terminar, a impressora será reinicializada automaticamente.";
InvalidPackage = "Houve problemas com o arquivo do firmware e o processo de atualização não foi bem sucedido. O problema pode ter sido causado por um erro de transmissão.\n\nTente novamente o processo de atualização do firmware.\nSe o problema persistir, entre em contato com a Assistência da HP.";
FailedDependencies = "O processo de atualização do Firmware não pôde ser concluído devido a um problema de dependência..\n\nA versão atual do Firmware é %@, e você está tentando instalar a %@.\n\nConsulte a seguinte página da Web para encontrar o pacote de atualização correto para esta impressora:\n%@.";
NotNow = "A atualização do firmware não foi feita com sucesso porque a impressora está ocupada (por exemplo, está processando ou imprimindo um trabalho).\n\nVerifique se a impressora está ociosa e faça novamente a atualização do firmware.";
TransmissionError = "Houve problemas com a transmissão, e por esse motivo a atualização do firmware não foi bem sucedida.\n\Verifique a conexão da impressora e faça novamente a atualização do Firmware.";
LicenseNotAccepted = "A atualização do firmware não foi feita porque a licença não foi aceita.";
FatalError = "Houve problemas que impediram a conclusão do processo de atualização do firmware.\n\nSe o problema persistir, entre em contato com a assistência da HP.";

// layout
TaskTitle = "Atualização do Firmware";
TaskDescription = "Selecione um arquivo com uma atualização de firmware e transfira-o para a impressora para sua atualização.";
FileNameTitle = "Nome do arquivo:";
FileNameField = "<Não selecionado>";
ChooseButton = "Escolher…";
UpdateButton = "Atualizar";
ProgressPanel = "Progresso da atualização";
FirmwareUpdateProcessTitle = "Atualizando…";
